# ScheduleRotationOnSheet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ScheduleRotationOnSheet Property
ParameterTypeId Class See Also
---
"Rotation on Sheet"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ScheduleRotationOnSheet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ScheduleRotationOnSheet As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ScheduleRotationOnSheet {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace